app/controllers/pokemon_controller.rb

INSERT INTO "pokemons" ("image_url", "attack", "defense", "name", "poke_type", "moves", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @pokemon = Pokemon.new(pokemon_params)

    if @pokemon.save

SELECT "pokemons".* FROM "pokemons"  ORDER BY "pokemons"."id" ASC
---
  def index
    @pokemon = Pokemon.order(:id)

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "pokemons" SET "name" = $1, "updated_at" = $2 WHERE "pokemons"."id" = $3  [["name", "Squirtle NEW CAPS NAME"], ["updated_at", "2015-08-04 00:50:09.924114"], ["id", 1]]
---
  def update
    @pokemon = Pokemon.find(params[:id])
    if @pokemon.update(pokemon_params)